package com.lifementos.webcrawler;

public class MockJobDescription {

    public static String jobDescription = "WORKS MOBILE에서 iOS/Android 개발자를 모집합니다.\n" +
            "[2022 WORKS MOBILE iOS/Android 개발자 모집]\n" +
            "\n" +
            "\n" +
            "# 담당 업무\n" +
            "- NAVER WORKS / LINE WORKS iOS 또는 Android App 개발\n" +
            "\n" +
            "\n" +
            "# 구체적인 업무내용 및 역할\n" +
            "- NAVER WORKS / LINE WORKS Mobile App 서비스 기능 개발 및 운영 이슈 대응\n" +
            "- 프로파일링을 통한 앱 성능 경량화/최적화\n" +
            "- 코드 품질 개선 (리팩토링, 디자인 패턴 적용)\n" +
            "- 효율적 빌드 환경 구성 및 모듈화\n" +
            "- 모바일 앱 아키텍쳐를 고려한 구조 설계 및 구현\n" +
            "- 앱 공통모듈화와 구조개선으로 품질 및 개발 효율성 강화\n" +
            "\n" +
            "# 지원자격\n" +
            "[iOS]\n" +
            "- iOS 앱 개발 3년 이상 유경험자\n" +
            "- Swift 개발 가능하신 분\n" +
            "- 동시성 프로그래밍에 대한 스킬과 경험이 있으신 분\n" +
            "- 코어 데이터를 활용한 로컬 데이터 관리 경험이 있으신 분\n" +
            "- iOS 프레임워크에 대한 이해와 활용 경험이 있으신 분\n" +
            "\n" +
            "[Android]\n" +
            "- Android 앱 개발 3년 이상 유경험자\n" +
            "- Java/Kotlin 언어 이해가 있으신 분\n" +
            "- Android 플랫폼과 디자인 가이드에 대한 이해가 있으신 분\n" +
            "- 비동기 프로그래밍에 익숙하신 분\n" +
            "\n" +
            "[공통]\n" +
            "- 최신 OS & Framework의 기능 및 모바일 기술 트렌드에 대해 관심이 많고 서비스에 적극 반영하는 역할이 가능하신 분\n" +
            "- 협업하는 동료들과 적극적으로 의사소통이 가능하신 분\n" +
            "- Rest API 연동 및 데이터 처리 경험이 있으신 분\n" +
            "\n" +
            "\n" +
            "\n" +
            "# 우대사항\n" +
            "- 요구사항 분석 및 기술 설계 활동에 관심이 많고 관련해서 다양한 경험과 노하우가 있으신 분\n" +
            "- 테스트 도구를 활용한 테스트 자동화 및 성능 테스트 수행 경험이 있으신 분\n" +
            "- 복잡한 UI 를 매끄럽게 동작시키기 위한 탄탄한 구현 로직에 관심이 많으신 분\n" +
            "- MVVM 패턴 설계/적용 경험이 있으신 분\n" +
            "- Testing framework을 활요한 UI 테스트/자동화 테스트 경험이 있으신 분\n" +
            "- Declarative UI(Jetpack compose, SwiftUI) 개발 경험이 있으신 분\n" +
            "- Kotlin Multiplatform 개발 경험이 있으신 분\n" +
            "\n" +
            "# 이런 분과 함께하고 싶습니다!\n" +
            "- 개발이 즐거우신 분\n" +
            "- 동료들을 배려하고 합리적인 의사소통이 가능하신 분\n" +
            "- 기술적인 부분에 있어서 자신감이 있고 추진력있게 실행하되 겸손한 태도를 갖추신 분\n" +
            "- 새로운 기술에 의욕적인 분\n" +
            "\n" +
            "\n" +
            "#전형절차 및 안내 사항\n" +
            "- 서류전형 > 온라인 코딩테스트> 1차면접 > 인적성 검사 > 2차 면접 > 최종면접 > 입사\n" +
            "* 서류전형 합격자에 한해 온라인 코딩테스트를 시행합니다.\n" +
            "- 모집기간 : 채용시 마감\n" +
            "- 고용형태: 정규직\n" +
            "- 근무장소: 판교\n" +
            "\n" +
            "\n" +
            "* 입사 후 3개월의 수습기간을 적용하며 평가결과에 따라 수습기간이 연장되거나 채용이 취소될 수 있습니다.\n" +
            "* 면접일정은 서류전형 합격자에 한하여 개별적으로 안내해 드립니다.\n" +
            "* 지원서 내용 중 허위사실이 있는 경우에는 합격이 취소될 수 있습니다.\n" +
            "* 국가유공자 및 장애인 등 취업보호대상자는 관계법령에 따라 우대합니다.\n" +
            "* 문의사항은 WORKS MOBILE 채용 홈페이지 > 채용문의로 접수해주시기 바랍니다.\n" +
            "\n" +
            "\n" +
            "지원하기";
}
